In [1]:
%load_ext sql
%sql postgresql://admin:admin@db:5432/company

Connecting to 'postgresql://admin:***@db:5432/company'

In [2]:
%%sql
SELECT * FROM student;

Running query in 'postgresql://admin:***@db:5432/company'

6 rows affected.

+----+--------+---------------------+-----+------------+
| id |  name  |        email        | age |    city    |
+----+--------+---------------------+-----+------------+
| 2  | Priya  |   priya@yahoo.com   |  30 |   Delhi    |
| 3  | Gaurav |  gourav@hotmail.com |  25 |  Kolkata   |
| 1  | Rajesh |   rajesh@gmail.com  |  26 |   Mumbai   |
| 6  | Simar  | prabsimar@gmail.com |  19 | Jamshedpur |
| 5  | Ankit  |   ankit@gmail.com   |  27 |  Banglore  |
| 4  | Saurav |   sourav@gmail.com  |  32 |  Channai   |
+----+--------+---------------------+-----+------------+

In [3]:
%%sql
ALTER TABLE student
RENAME COLUMN name to full_name;

Running query in 'postgresql://admin:***@db:5432/company'

++
||
++
++

In [4]:
%%sql
select * from student;

Running query in 'postgresql://admin:***@db:5432/company'

6 rows affected.

+----+-----------+---------------------+-----+------------+
| id | full_name |        email        | age |    city    |
+----+-----------+---------------------+-----+------------+
| 2  |   Priya   |   priya@yahoo.com   |  30 |   Delhi    |
| 3  |   Gaurav  |  gourav@hotmail.com |  25 |  Kolkata   |
| 1  |   Rajesh  |   rajesh@gmail.com  |  26 |   Mumbai   |
| 6  |   Simar   | prabsimar@gmail.com |  19 | Jamshedpur |
| 5  |   Ankit   |   ankit@gmail.com   |  27 |  Banglore  |
| 4  |   Saurav  |   sourav@gmail.com  |  32 |  Channai   |
+----+-----------+---------------------+-----+------------+

In [7]:
%%sql
ALTER TABLE student
ALTER COLUMN age TYPE SMALLINT;

Running query in 'postgresql://admin:***@db:5432/company'

++
||
++
++

In [8]:
%%sql
select * from student;

Running query in 'postgresql://admin:***@db:5432/company'

6 rows affected.

+----+-----------+---------------------+-----+------------+
| id | full_name |        email        | age |    city    |
+----+-----------+---------------------+-----+------------+
| 2  |   Priya   |   priya@yahoo.com   |  30 |   Delhi    |
| 3  |   Gaurav  |  gourav@hotmail.com |  25 |  Kolkata   |
| 1  |   Rajesh  |   rajesh@gmail.com  |  26 |   Mumbai   |
| 6  |   Simar   | prabsimar@gmail.com |  19 | Jamshedpur |
| 5  |   Ankit   |   ankit@gmail.com   |  27 |  Banglore  |
| 4  |   Saurav  |   sourav@gmail.com  |  32 |  Channai   |
+----+-----------+---------------------+-----+------------+

In [9]:
%%sql
-- To add non-null constrain to city column
ALTER TABLE student
ALTER COLUMN city SET NOT NULL;

Running query in 'postgresql://admin:***@db:5432/company'

++
||
++
++

In [10]:
%%sql
select * from student;

Running query in 'postgresql://admin:***@db:5432/company'

6 rows affected.

+----+-----------+---------------------+-----+------------+
| id | full_name |        email        | age |    city    |
+----+-----------+---------------------+-----+------------+
| 2  |   Priya   |   priya@yahoo.com   |  30 |   Delhi    |
| 3  |   Gaurav  |  gourav@hotmail.com |  25 |  Kolkata   |
| 1  |   Rajesh  |   rajesh@gmail.com  |  26 |   Mumbai   |
| 6  |   Simar   | prabsimar@gmail.com |  19 | Jamshedpur |
| 5  |   Ankit   |   ankit@gmail.com   |  27 |  Banglore  |
| 4  |   Saurav  |   sourav@gmail.com  |  32 |  Channai   |
+----+-----------+---------------------+-----+------------+

In [13]:
%%sql
-- Adding check constaint to age column
ALTER TABLE student
ADD CONSTRAINT age CHECK(age >= 18);

Running query in 'postgresql://admin:***@db:5432/company'

++
||
++
++

In [14]:
%%sql
select * from student;

Running query in 'postgresql://admin:***@db:5432/company'

6 rows affected.

+----+-----------+---------------------+-----+------------+
| id | full_name |        email        | age |    city    |
+----+-----------+---------------------+-----+------------+
| 2  |   Priya   |   priya@yahoo.com   |  30 |   Delhi    |
| 3  |   Gaurav  |  gourav@hotmail.com |  25 |  Kolkata   |
| 1  |   Rajesh  |   rajesh@gmail.com  |  26 |   Mumbai   |
| 6  |   Simar   | prabsimar@gmail.com |  19 | Jamshedpur |
| 5  |   Ankit   |   ankit@gmail.com   |  27 |  Banglore  |
| 4  |   Saurav  |   sourav@gmail.com  |  32 |  Channai   |
+----+-----------+---------------------+-----+------------+

In [15]:
%%sql
ALTER TABLE student
DROP CONSTRAINT age;

Running query in 'postgresql://admin:***@db:5432/company'

++
||
++
++

In [16]:
%%sql
ALTER TABLE student
ADD CONSTRAINT age CHECK(age >= 18);

Running query in 'postgresql://admin:***@db:5432/company'

++
||
++
++

In [17]:
%%sql
INSERT INTO student (full_name, email, age, city)
VALUES ('Vinod', 'vinodgmail.com', 60, 'Jamshedpur');

Running query in 'postgresql://admin:***@db:5432/company'

1 rows affected.

++
||
++
++

In [18]:
%%sql
select * from student;

Running query in 'postgresql://admin:***@db:5432/company'

7 rows affected.

+----+-----------+---------------------+-----+------------+
| id | full_name |        email        | age |    city    |
+----+-----------+---------------------+-----+------------+
| 2  |   Priya   |   priya@yahoo.com   |  30 |   Delhi    |
| 3  |   Gaurav  |  gourav@hotmail.com |  25 |  Kolkata   |
| 1  |   Rajesh  |   rajesh@gmail.com  |  26 |   Mumbai   |
| 6  |   Simar   | prabsimar@gmail.com |  19 | Jamshedpur |
| 5  |   Ankit   |   ankit@gmail.com   |  27 |  Banglore  |
| 4  |   Saurav  |   sourav@gmail.com  |  32 |  Channai   |
| 7  |   Vinod   |    vinodgmail.com   |  60 | Jamshedpur |
+----+-----------+---------------------+-----+------------+

In [19]:
%%sql
ALTER TABLE student
RENAME TO customers;

Running query in 'postgresql://admin:***@db:5432/company'

++
||
++
++

In [20]:
%%sql
select * from customers;

Running query in 'postgresql://admin:***@db:5432/company'

7 rows affected.

+----+-----------+---------------------+-----+------------+
| id | full_name |        email        | age |    city    |
+----+-----------+---------------------+-----+------------+
| 2  |   Priya   |   priya@yahoo.com   |  30 |   Delhi    |
| 3  |   Gaurav  |  gourav@hotmail.com |  25 |  Kolkata   |
| 1  |   Rajesh  |   rajesh@gmail.com  |  26 |   Mumbai   |
| 6  |   Simar   | prabsimar@gmail.com |  19 | Jamshedpur |
| 5  |   Ankit   |   ankit@gmail.com   |  27 |  Banglore  |
| 4  |   Saurav  |   sourav@gmail.com  |  32 |  Channai   |
| 7  |   Vinod   |    vinodgmail.com   |  60 | Jamshedpur |
+----+-----------+---------------------+-----+------------+